<template>
  <v-container>
    <h1>Тестовое задание SquareGPS</h1>

    <p>
      Необходимо с помощью <strong>Vuejs</strong>, <strong>Vuex</strong>,
      <strong>VueRouter</strong>, <strong>Vuetify</strong> написать
      приложение.<br />
      Хэдер приложения должен содержать меню из 2-х пунктов:
      <strong>О задании</strong> и <strong>Карта</strong>.<br />
      В основной части приложения должно отображаться содержимое разделов.
    </p>

    <h2>Раздел “О задании”</h2>
    <p>В разделе должен быть текст этого задания, сверстанный аналогично.</p>

    <h2>Раздел “Карта”</h2>
    <p>
      На экране должны быть карта и список (см пример):<br />
      <ol>
        <li>При клике на кнопку добавления, карта должна перейти в режим добавления
      маркера: в месте клика должен появится маркер, а в списке - запись с
      адресом точки</li>
      </ol>
    </p>
    <p>
      Для поиска адреса можно использовать любое бесплатное API для
      геокодирования, например:
      <a href="https://geocode.maps.co/" target="_blank">
        https://geocode.maps.co/
      </a>
    </p>
    <p>
      В случае, если адрес не найден, необходимо вывести ошибку и не добавлять
      маркер в список.
    </p>
    <p>
      <ol start="2">
        <li>При клике на маркер должна подсвечиваться запись в списке</li>
        <li>При клике на запись в списке карта должна центрироваться на маркере</li>
        <li>Маркеры должны храниться локально и не пропадать после перезагрузки
      страницы</li>
        <li>В адресной строке должен отображаться id выбранного маркера</li>
      </ol>
    </p>
    <p>
      Локальное хранение данных должно быть организовано в виде сервиса,
      эмулирующего бекенд. (Необходим класс Backend, который псевдо-асинхронно
      сохраняет данные в localStorage)
    </p>

    <h3>Дополнительно:</h3>
    <p>
      <ol>
        <li>Продумать отображение на мобильных устройствах</li>
        <li>Предусмотреть локализацию</li>
        <li>Необходимо с помощью <strong>jest</strong> написать 1 модульный тест на любой компонент</li>
      </ol>
    </p>
    <p>
      <strong>Напоминание:</strong> тестовое задание призвано показать умение
      писать хороший модульный код, а также умение пользоваться указанными
      технологиями и не только. Этим кодом нужно гордиться.
    </p>
    <p>Пример:</p>
    <img src="@/assets/img/example.png" alt="example" width="100%" />
  </v-container>
</template>

<script>
export default {
  name: "TaskView",
};
</script>
